Revit 2024 API
Edge.ComputeDerivatives Method
Returns the vectors describing the edge at the specified parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Transform ComputeDerivatives(
	double parameter
)
Visual Basic
Public Function ComputeDerivatives ( _
	parameter As Double _
) As Transform
Visual C++
public:
Transform^ ComputeDerivatives(
	double parameter
)
Parameters
parameter
Type: System.Double
The parameter to be evaluated.
Return Value
The transformation containing a tangent vector, derivative of tangent vector, and bi-normal vector.
Remarks
 The following is the meaning of the transformation members:
Origin is the point on the edge (equivalent to Evaluate);
BasisX is the tangent vector (the first derivative);
BasisY is the second derivative;
BasisZ is the bi-normal vector (tangent x normal).
Normal and bi-normal are zero if the edge is straight at the point. None of the vectors are normalized.
See Also
Edge Class
Autodesk.Revit.DB Namespace